<a href="https://colab.research.google.com/github/Benjaminherrera1/lab/blob/main/DataframePandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Ejemplo de tabla

|  Nombre | Edad  |  Altura  |   |   |
|---|---|---|---|---|
| Juan | 16  |  1.69 |   |   |
| Maria|  15 |  1.60 |   |   |
| Pedro |  16 |  1.73 |   |   |

In [ ]:
import pandas as pd

In [1]:

df2 = pd.read_csv("https://docs.google.com/spreadsheets/d/12MHNWZnbekh6RClFcxRcixMB90ooPsUsg3Tt9L7OllM/export?format=csv")
df2

NameError: ignored

In [ ]:
 
datos = [
        {"Nombre":"Juan", "Edad":16,"Altura": 1.69},
        {"Nombre":"Maria", "Edad":15,"Altura": 1.60},
        {"Nombre":"Pedro", "Edad":16,"Altura": 1.73}
        ]

df3 = pd.DataFrame(datos)
df3

  Nombre  Edad  Altura
0   Juan    16    1.69
1  Maria    15    1.60
2  Pedro    16    1.73

In [ ]:


datos = [
  ["Juan", 16, 1.69], 
  ["Maria",15,1.60], 
  ["Pedro", 1.6, 1.73] 
  ]

df4 = pd.DataFrame(datos, columns=["Nombre", "Edad", "Altura"])
df4

  Nombre  Edad  Altura
0   Juan  16.0    1.69
1  Maria  15.0    1.60
2  Pedro   1.6    1.73

In [ ]:
df5 = pd.DataFrame()
df5["Nombre"] = ["Juan","Maria", "Pedro"]
df5["Edad"] = [16,15,16]
df5["Altura"] = [1.69,1.60,1.73]

df5

  Nombre  Edad  Altura
0   Juan    16    1.69
1  Maria    15    1.60
2  Pedro    16    1.73

In [ ]:
df = pd.read_csv

In [ ]:

df

    Nombre    Apellido  Edad  Peso  Altura
0  Roberto      Alfaro    16    70    1.78
1    Laura  Bustamante    15    57    1.60
2    Erick     Estrada    16    65    1.74
3    Maria   Domínguez    15    52    1.60
4   Jorge        Ortíz    17    60    1.70
5     Rosa     Jiménez    16    56    1.53

In [ ]:

df.describe()

            Edad       Peso    Altura
count   6.000000   6.000000  6.000000
mean   15.833333  60.000000  1.658333
std     0.752773   6.542171  0.096419
min    15.000000  52.000000  1.530000
25%    15.250000  56.250000  1.600000
50%    16.000000  58.500000  1.650000
75%    16.000000  63.750000  1.730000
max    17.000000  70.000000  1.780000

In [ ]:
df[["Edad","Altura","Nombre"]]

   Edad  Altura   Nombre
0    16    1.78  Roberto
1    15    1.60    Laura
2    16    1.74    Erick
3    15    1.60    Maria
4    17    1.70   Jorge
5    16    1.53     Rosa

In [ ]:

df["Nombre_completo"] = df["Nombre"] + " " + df["Apellido"]
df["imc"] = df["Peso"] / (df["Altura"] * df["Altura"])

In [ ]:
df

    Nombre    Apellido  Edad  Peso  Altura   Nombre_completo        imc
0  Roberto      Alfaro    16    70    1.78    Roberto Alfaro  22.093170
1    Laura  Bustamante    15    57    1.60  Laura Bustamante  22.265625
2    Erick     Estrada    16    65    1.74     Erick Estrada  21.469150
3    Maria   Domínguez    15    52    1.60   Maria Domínguez  20.312500
4   Jorge        Ortíz    17    60    1.70      Jorge  Ortíz  20.761246
5     Rosa     Jiménez    16    56    1.53      Rosa Jiménez  23.922423

In [ ]:
df[(df["Edad"] >= 16) | (df["Altura"] > 1.60)]

    Nombre Apellido  Edad  Peso  Altura Nombre_completo        imc
0  Roberto   Alfaro    16    70    1.78  Roberto Alfaro  22.093170
2    Erick  Estrada    16    65    1.74   Erick Estrada  21.469150
4   Jorge     Ortíz    17    60    1.70    Jorge  Ortíz  20.761246
5     Rosa  Jiménez    16    56    1.53    Rosa Jiménez  23.922423

In [ ]:
df.groupby('Edad').size()

Edad
15    2
16    3
17    1
dtype: int64